In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.428542  0.661164
1  X   beta  1.640177 -0.646907
2  Y  alpha  1.497890  0.921670
3  Y   beta  1.356642 -0.485768
4  Z  alpha  0.498194  0.763714

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
group1

In [6]:
group1.mean()

k1
X    1.034360
Y    1.427266
Z    0.498194
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])
#それぞれグループ化
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    1.640177
    JAN    1.497890
NY  FEB    1.356642
    JAN    0.463368
Name: dataset1, dtype: float64

In [9]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   1.034360  0.007128
Y   1.427266  0.217951
Z   0.498194  0.763714

In [10]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.428542  0.661164
1  X   beta  1.640177 -0.646907
2  Y  alpha  1.497890  0.921670
3  Y   beta  1.356642 -0.485768
4  Z  alpha  0.498194  0.763714

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.428542  0.661164
   beta   1.640177 -0.646907
Y  alpha  1.497890  0.921670
   beta   1.356642 -0.485768
Z  alpha  0.498194  0.763714

In [12]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [14]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.661164
   beta  -0.646907
Y  alpha  0.921670
   beta  -0.485768
Z  alpha  0.763714

In [15]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [17]:
for name, group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.428542  0.661164
1  X   beta  1.640177 -0.646907


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  1.497890  0.921670
3  Y   beta  1.356642 -0.485768


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  0.498194  0.763714

In [18]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print('Ke1 = {} Key2 = {}'.format(k1,k2))
    print(group)
    print('\n')

Ke1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.428542  0.661164


Ke1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  1.640177 -0.646907


Ke1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha   1.49789   0.92167


Ke1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  1.356642 -0.485768


Ke1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  0.498194  0.763714

In [19]:
gr = dframe.groupby('k1')

In [20]:
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha  0.428542  0.661164
1  X   beta  1.640177 -0.646907

In [21]:
group_dict = dict(list(dframe.groupby('k1')))

In [23]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  0.428542  0.661164
1  X   beta  1.640177 -0.646907

In [24]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [25]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.428542  0.661164
 1  1.640177 -0.646907
 2  1.497890  0.921670
 3  1.356642 -0.485768
 4  0.498194  0.763714, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}